Install relevant libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
import os
#print(os.getcwd())

Import dataset

In [3]:
import pandas as pd
import os

# Using a raw string for the file path
file_path = r'C:\Users\gurmo\Downloads\LHL_Final_Capstone_Project\data\credit_card_india.csv'

# Check if the file exists
if os.path.exists(file_path):
    df = pd.read_csv(file_path)
else:
    print("File not found:", file_path)

In [4]:
df.head()

   index                   City       Date  Card Type Exp Type Gender  Amount
0      0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2      2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4      4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

Understanding the data

In [5]:
df.shape

(26052, 7)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26052 entries, 0 to 26051
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      26052 non-null  int64
 1   City       26052 non-null  object
 2   Date       26052 non-null  object
 3   Card Type  26052 non-null  object
 4   Exp Type   26052 non-null  object
 5   Gender     26052 non-null  object
 6   Amount     26052 non-null  int64
dtypes: int64(2), object(5)
memory usage: 1.4+ MB

More details about data

In [7]:
Card_Type = df['Card Type'].unique()
print('Card Types = ', Card_Type)
Exp_Type = df['Exp Type'].unique()
print('Expense Types = ', Exp_Type)
City = len(df['City'].unique())
print('Cities = ', City)

Card Types =  ['Gold' 'Platinum' 'Silver' 'Signature']
Expense Types =  ['Bills' 'Food' 'Entertainment' 'Grocery' 'Fuel' 'Travel']
Cities =  986

Duplicate and null values

In [8]:
df.duplicated().sum()

0

In [9]:
df.isnull().sum()

index        0
City         0
Date         0
Card Type    0
Exp Type     0
Gender       0
Amount       0
dtype: int64

Data conversion

In [10]:
df.set_index('index', inplace = True)
df

                        City       Date  Card Type Exp Type Gender  Amount
index
0               Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2           Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4           Bengaluru, India   5-May-15       Gold    Bills      F  171574
...                      ...        ...        ...      ...    ...     ...
26047         Kolkata, India  22-Jun-14     Silver   Travel      F  128191
26048            Pune, India   3-Aug-14  Signature   Travel      M  246316
26049       Hyderabad, India  16-Jan-15     Silver   Travel      M  265019
26050          Kanpur, India  14-Sep-14     Silver   Travel      M   88174
26051       Hyderabad, India  19-Oct-13  Signature    Bills      M  184410

[26052 rows x 6 columns]

In [11]:
df["Date"]=pd.to_datetime(df["Date"])
df.dtypes

City                 object
Date         datetime64[ns]
Card Type            object
Exp Type             object
Gender               object
Amount                int64
dtype: object

In [12]:
df['Gender'] = df['Gender'].replace('F', 'Female')
df['Gender'] = df['Gender'].replace('M', 'Male')
df

                        City       Date  Card Type Exp Type  Gender  Amount
index
0               Delhi, India 2014-10-29       Gold    Bills  Female   82475
1      Greater Mumbai, India 2014-08-22   Platinum    Bills  Female   32555
2           Bengaluru, India 2014-08-27     Silver    Bills  Female  101738
3      Greater Mumbai, India 2014-04-12  Signature    Bills  Female  123424
4           Bengaluru, India 2015-05-05       Gold    Bills  Female  171574
...                      ...        ...        ...      ...     ...     ...
26047         Kolkata, India 2014-06-22     Silver   Travel  Female  128191
26048            Pune, India 2014-08-03  Signature   Travel    Male  246316
26049       Hyderabad, India 2015-01-16     Silver   Travel    Male  265019
26050          Kanpur, India 2014-09-14     Silver   Travel    Male   88174
26051       Hyderabad, India 2013-10-19  Signature    Bills    Male  184410

[26052 rows x 6 columns]

In [13]:
# split the city column to city and country columns

df[['City', 'Country']] = df['City'].str.split(',', expand=True)
df

                 City       Date  Card Type Exp Type  Gender  Amount Country
index
0               Delhi 2014-10-29       Gold    Bills  Female   82475   India
1      Greater Mumbai 2014-08-22   Platinum    Bills  Female   32555   India
2           Bengaluru 2014-08-27     Silver    Bills  Female  101738   India
3      Greater Mumbai 2014-04-12  Signature    Bills  Female  123424   India
4           Bengaluru 2015-05-05       Gold    Bills  Female  171574   India
...               ...        ...        ...      ...     ...     ...     ...
26047         Kolkata 2014-06-22     Silver   Travel  Female  128191   India
26048            Pune 2014-08-03  Signature   Travel    Male  246316   India
26049       Hyderabad 2015-01-16     Silver   Travel    Male  265019   India
26050          Kanpur 2014-09-14     Silver   Travel    Male   88174   India
26051       Hyderabad 2013-10-19  Signature    Bills    Male  184410   India

[26052 rows x 7 columns]

In [14]:
df.head()

                 City       Date  Card Type Exp Type  Gender  Amount Country
index
0               Delhi 2014-10-29       Gold    Bills  Female   82475   India
1      Greater Mumbai 2014-08-22   Platinum    Bills  Female   32555   India
2           Bengaluru 2014-08-27     Silver    Bills  Female  101738   India
3      Greater Mumbai 2014-04-12  Signature    Bills  Female  123424   India
4           Bengaluru 2015-05-05       Gold    Bills  Female  171574   India

In [15]:
## Changing Dtype of date and Extracting Month name, day name, weekday from Date 

from datetime import datetime as dt
df["Date"]=pd.to_datetime(df["Date"])
df["Month"]=df["Date"].dt.month_name()
df["Day"]=df["Date"].dt.day_name()

df.sample(2)

,City,Date,Card Type,Exp Type,Gender,Amount,Country,Month,Day
index,,,,,,,,,
5763,Ahmedabad,2014-11-07,Silver,Fuel,Female,113164,India,November,Friday
25628,Kanpur,2013-11-23,Signature,Travel,Female,14767,India,November,Saturday

In [16]:
df.head()

,City,Date,Card Type,Exp Type,Gender,Amount,Country,Month,Day
index,,,,,,,,,
0,Delhi,2014-10-29,Gold,Bills,Female,82475,India,October,Wednesday
1,Greater Mumbai,2014-08-22,Platinum,Bills,Female,32555,India,August,Friday
2,Bengaluru,2014-08-27,Silver,Bills,Female,101738,India,August,Wednesday
3,Greater Mumbai,2014-04-12,Signature,Bills,Female,123424,India,April,Saturday
4,Bengaluru,2015-05-05,Gold,Bills,Female,171574,India,May,Tuesday

In [16]:
#cleaned data set export
df1=df
df1.to_csv('cleaned_data_india_credit.csv1')